# UpdateFailureSingle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PathOfTravelFailures..::..UpdateFailureSingle Property
BuiltInFailures..::..PathOfTravelFailures Class See Also
---
Path of Travel failed to update.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UpdateFailureSingle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UpdateFailureSingle As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UpdateFailureSingle {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PathOfTravelFailures Class
Autodesk.Revit.DB Namespace